# Taps: Third-party repositories
tap "homebrew/bundle"
tap "homebrew/services"

# Binaries: CLI tools and Languages
brew "bat"           # color-ized cat
brew "git"           # High-performance version control
brew "node"          # Includes NPM
brew "gh"            # GitHub CLI (Required for Copilot-CLI)
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "tree"          # Visualizing directory structures
# CLI-only tools (installed via 'brew install')
brew "jq"             # Lightweight and flexible command-line JSON processor
brew "lsusb"
# CLI Search & Discovery
brew "fzf"           # Interactive CLI fuzzy finder (great for history/files)
brew "ripgrep"       # Extremely fast grep -r (the search engine)
brew "fd"            # A faster, user-friendly alternative to 'find' (the file lister)

# Casks: GUI Applications
cask "visual-studio-code"
cask "font-fira-code-nerd-font" # Best for ligatures and CLI icons
cask "hot"   # CPU temperature display in taskbar

# Mac App Store (Optional - requires 'mas' brew)
# brew "mas"
# mas "Xcode", id: 497799835
